Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.IndexOf Method
 Searches for the specified BinaryFilterExpressionItem in the collection and returns a zero-based index if found.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int IndexOf(
	BinaryFilterExpressionItem Item
)
Public Function IndexOf (
	Item As BinaryFilterExpressionItem
) As Integer
Parameters
Item
Type: Tekla.Structures.Filtering.BinaryFilterExpressionItem
The item to search for. This value cannot be null.
Return Value
Type: Int32
The zero-based index of the item in the collection. -1 if not found.
Implements
IList<T>.IndexOf(T)
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the supplied item is null.
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace